
public class Hello {

	public static void main(String[] args) {
		/*객체안의 변수를 필드라고 한다.
		 *참조 변수를 객체의 이름으로 생각해도 좋다, 메모리에 생성된 객체는 이름이 없으므로 참조변수를 객체의 이름으로 생각할 수 있다.
		 *참조 변수를 객체를 제어하는 리모콘이라고 생각해도 좋다. 아니면 참조변수는 화살표라고 생각해도 된다.
		 *ex) Television tv = new Television();
		 *위 문장에서 tv라는 참조변수를 new 연산자를 통해 만들어진 Television클래스(설계도)의 객체의 이름으로 생각해도 된다. 
		 *객체 안에 있는 변수를 필드(field)라고 하고 객체의 동작을 나타내는 부분을 메소드(method)라고 한다.
		 *클래스 안에는 필드와 메소드들이 정의되는데 이들을 클래스의 멤버(member)라고 부른다.
		 *클래스는 객체의 설계도이다.
		 *일반적으로 자바에서는 하나의 소스파일에 하나의 클래스만을 담는 것이 원칙이다.
		 *ex)Television클래스는 Television.java에 저장되고 TelevisionTest클래스는 TelevisionTest.java에 저장되어야한다.
		 *하지만 귀찮아서 하나의 소스파일에 여러개의 클래스를 넣을 수도 있다. 이때 반드시 public앞에 있는 클래스는 소스파일의 이름과 일치해야한다.
		 *메소드는 입력을 받아서 처리결과를 반환하는 상자로 생각하자.
		 *메소드는 클래스 안에 정의돈 함수로 이해해도 괜찮다.
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		*/
	}

}
